<?xml version="1.0"?>
<net name="detokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_114" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="Parameter_114">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Convert_130" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_82" type="Const" version="opset1">
			<data element_type="u8" shape="615464" offset="0" size="615464" />
			<output>
				<port id="0" precision="U8">
					<dim>615464</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StringTensorUnpack_83" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>615464</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="VocabDecoder_115" type="VocabDecoder" version="extension">
			<data skip_tokens="" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="CharsToBytes_116" type="CharsToBytes" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_118" type="Const" version="opset1">
			<data element_type="u8" shape="47" offset="615464" size="47" />
			<output>
				<port id="0" precision="U8">
					<dim>47</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_120" type="Const" version="opset1">
			<data element_type="u8" shape="2" offset="615511" size="2" />
			<output>
				<port id="0" precision="U8">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="RegexNormalization_121" type="RegexNormalization" version="extension">
			<data global_replace="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>47</dim>
				</port>
				<port id="4" precision="U8">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StringTensorPack_122" type="StringTensorPack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="U8">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="STRING" names="string_output">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Result_123" type="Result" version="opset1">
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="4" to-port="2" />
		<edge from-layer="3" from-port="3" to-layer="4" to-port="3" />
		<edge from-layer="4" from-port="4" to-layer="5" to-port="0" />
		<edge from-layer="4" from-port="5" to-layer="5" to-port="1" />
		<edge from-layer="4" from-port="6" to-layer="5" to-port="2" />
		<edge from-layer="4" from-port="7" to-layer="5" to-port="3" />
		<edge from-layer="4" from-port="8" to-layer="5" to-port="4" />
		<edge from-layer="5" from-port="5" to-layer="8" to-port="0" />
		<edge from-layer="5" from-port="6" to-layer="8" to-port="1" />
		<edge from-layer="5" from-port="7" to-layer="8" to-port="2" />
		<edge from-layer="6" from-port="0" to-layer="8" to-port="3" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="4" />
		<edge from-layer="8" from-port="5" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="6" to-layer="9" to-port="1" />
		<edge from-layer="8" from-port="7" to-layer="9" to-port="2" />
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0" />
	</edges>
	<rt_info>
		<eos_token_id value="50257" />
	</rt_info>
</net>
