<?xml version="1.0"?>
<net name="TensorFlow_Lite_Frontend_IR" version="11">
	<layers>
		<layer id="2" name="hand" type="Parameter" version="opset1">
			<data shape="1,21,3" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="hand">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="handedness" type="Parameter" version="opset1">
			<data shape="1,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="handedness">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="world_hand" type="Parameter" version="opset1">
			<data shape="1,21,3" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="world_hand">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model_4/tf.compat.v1.gather_3/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" shape="6" offset="0" size="24" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.compat.v1.gather_3/GatherV2/indices">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_2126" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="24" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="0" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>6</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="model_4/tf.compat.v1.gather_3/GatherV2;model_4/tf.compat.v1.gather_3/GatherV2/axis">
					<dim>1</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_4/tf.compat.v1.gather_3/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="24" size="4" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.compat.v1.gather_3/GatherV2/axis" />
			</output>
		</layer>
		<layer id="7" name="1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_mean_3/Mean">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.subtract_9/Sub">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_2130" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="28" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Split_2131" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Squeeze_2132" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.unstack_3/unstack">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model_4/tf.math.reduce_max_6/Max/reduction_indices" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="36" size="4" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.math.reduce_max_6/Max/reduction_indices" />
			</output>
		</layer>
		<layer id="13" name="4" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_max_6/Max">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="6" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_min_6/Min">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="7" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.subtract_10/Sub">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Squeeze_2133" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.unstack_3/unstack1">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="5" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_max_7/Max">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="8" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_min_7/Min">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="9" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.subtract_11/Sub">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="10" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.maximum_3/Maximum">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model_4/tf.__operators__.getitem_3/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="40" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="model_4/tf.__operators__.getitem_3/strided_slice/stack_2">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="11" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.getitem_3/strided_slice,model_4/tf.__operators__.getitem_3/strided_slice1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_4442_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="52" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_4442" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_12/AddV2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="14" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.truediv_3/truediv">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model_4/reshape_1/Reshape/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="54" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="model_4/reshape_1/Reshape/shape">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="15" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/reshape_1/Reshape">
					<dim>1</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model_4/dense_12/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 63" offset="62" size="16128" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_12/MatMul">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model_4/dense_12/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MatMul_2156" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_4443_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="16190" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_4443" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="16" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_12/MatMul;model_4/dense_12/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model_4/batch_normalization_10/batchnorm/mul_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 63" offset="16446" size="16128" />
			<output>
				<port id="0" precision="FP16" names="model_4/batch_normalization_10/batchnorm/mul_1">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model_4/batch_normalization_10/batchnorm/mul_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MatMul_2167" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_4444_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="32574" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_4444" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="17" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="17_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/dense_12/MatMul;model_4/dense_12/BiasAdd;model_4/batch_normalization_10/batchnorm/mul_1;model_4/re_lu_10/Relu;model_4/batch_normalization_10/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model_4/dense_13/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="32830" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_13/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_4/dense_13/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="MatMul_2179" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_4445_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="65598" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_4445" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_13/MatMul;model_4/dense_13/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="19" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_13/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_4446_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="65854" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_4446" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="20" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_11/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_4447_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="66110" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_4447" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Add_2183" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="21" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_11/Relu;model_4/batch_normalization_11/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model_4/dense_14/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="66366" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_14/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model_4/dense_14/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MatMul_2194" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_4448_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="99134" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_4448" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="22" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_14/MatMul;model_4/dense_14/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="23" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_14/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_4449_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="99390" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_4449" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="24" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_12/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_4450_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="99646" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_4450" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Add_2198" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_12/Relu;model_4/batch_normalization_12/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model_4/dense_15/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="99902" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_15/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model_4/dense_15/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MatMul_2209" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_4451_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="132670" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_4451" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="26" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_15/MatMul;model_4/dense_15/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="27" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_15/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_4452_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="132926" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_4452" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="28" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_13/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_4453_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="133182" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_4453" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Add_2213" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="29" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_13/Relu;model_4/batch_normalization_13/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model_4/dense_16/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="133438" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_16/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model_4/dense_16/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="MatMul_2224" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_4454_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="166206" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_4454" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="30" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_16/MatMul;model_4/dense_16/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="31" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_16/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_4455_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="166462" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_4455" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="32" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_14/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_4456_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="166718" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_4456" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Add_2228" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_14/Relu;model_4/batch_normalization_14/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model_4/dense_17/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="166974" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_17/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model_4/dense_17/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="MatMul_2239" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_4457_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="199742" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_4457" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="34" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_17/MatMul;model_4/dense_17/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="35" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_17/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_4458_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="199998" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_4458" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="36" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_15/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_4459_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="200254" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_4459" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Add_2243" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="37" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_15/Relu;model_4/batch_normalization_15/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model_4/dense_18/MatMul_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="200510" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/dense_18/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model_4/dense_18/MatMul" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="MatMul_2254" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_4460_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="233278" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_4460" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="38" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_18/MatMul;model_4/dense_18/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="39" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_18/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_4461_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="233534" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_4461" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="40" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_16/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_4462_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="233790" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_4462" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Add_2258" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="41" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_16/Relu;model_4/batch_normalization_16/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="model_4/batch_normalization_17/batchnorm/mul_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="234046" size="32768" />
			<output>
				<port id="0" precision="FP16" names="model_4/batch_normalization_17/batchnorm/mul_1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="model_4/batch_normalization_17/batchnorm/mul_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="MatMul_2269" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_4463_compressed" type="Const" version="opset1">
